exacttarget/exacttarget-connector/exacttarget-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/requests/exacttarget/api_listDataExtensionObjects_optional.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://exacttarget.com/wsdl/partnerAPI"
   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Header>
      <fueloauth xmlns="http://exacttarget.com">%s(accessToken)</fueloauth>
   </soapenv:Header>
   <soapenv:Body>
      <RetrieveRequestMsg xmlns="http://exacttarget.com/wsdl/partnerAPI">
         <RetrieveRequest>
            <ObjectType>DataExtensionObject[%s(dataExtCustomerKey)]</ObjectType>
            <Properties>%s(dataExtField1)</Properties>
            <Properties>%s(dataExtField2)</Properties>
            <Filter xmlns="http://exacttarget.com/wsdl/partnerAPI" xsi:type="SimpleFilterPart">
               <Property>%s(dataExtField1)</Property>
               <SimpleOperator>equals</SimpleOperator>
               <Value>%s(fieldOneVlaue)</Value>
            </Filter>
         </RetrieveRequest>
      </RetrieveRequestMsg>
   </soapenv:Body>
</soapenv:Envelope>